In [24]:
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt

In [25]:
s = pd.Series([1,3,5,np.nan,6,8])

In [26]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [27]:
dates = pd.date_range('20130101', periods=6)

In [28]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [29]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [30]:
df

                   A         B         C         D
2013-01-01 -0.425488  2.169890 -0.168240  1.343118
2013-01-02  0.076999  0.773222 -0.475579  0.626561
2013-01-03 -0.246028 -0.359273 -0.616782  0.114790
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812
2013-01-05  1.466021  1.571671 -1.128318 -1.585989
2013-01-06 -1.328971 -1.336126 -0.085670 -0.630667

In [31]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

In [32]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [33]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [34]:
df2.corr

<bound method DataFrame.corr of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [35]:
df2.boxplot

<bound method DataFrame.boxplot of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [36]:
df.head

<bound method DataFrame.head of                    A         B         C         D
2013-01-01 -0.425488  2.169890 -0.168240  1.343118
2013-01-02  0.076999  0.773222 -0.475579  0.626561
2013-01-03 -0.246028 -0.359273 -0.616782  0.114790
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812
2013-01-05  1.466021  1.571671 -1.128318 -1.585989
2013-01-06 -1.328971 -1.336126 -0.085670 -0.630667>

In [43]:
df.tail(2)

                   A         B         C         D
2013-01-05  1.466021  1.571671 -1.128318 -1.585989
2013-01-06 -1.328971 -1.336126 -0.085670 -0.630667

In [38]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812
2013-01-05  1.466021  1.571671 -1.128318 -1.585989
2013-01-06 -1.328971 -1.336126 -0.085670 -0.630667

In [44]:
df.head()

                   A         B         C         D
2013-01-01 -0.425488  2.169890 -0.168240  1.343118
2013-01-02  0.076999  0.773222 -0.475579  0.626561
2013-01-03 -0.246028 -0.359273 -0.616782  0.114790
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812
2013-01-05  1.466021  1.571671 -1.128318 -1.585989

In [45]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [46]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [47]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [48]:
df.values

array([[-0.4254878 ,  2.16988999, -0.16824033,  1.34311799],
       [ 0.07699883,  0.77322221, -0.47557866,  0.62656083],
       [-0.24602789, -0.35927323, -0.61678203,  0.11479031],
       [ 1.23754303, -1.02911875, -0.33422425, -0.32181165],
       [ 1.46602071,  1.57167102, -1.12831823, -1.5859888 ],
       [-1.32897062, -1.33612606, -0.0856701 , -0.6306666 ]])

In [49]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.130013  0.298378 -0.468136 -0.075666
std    1.057636  1.429382  0.377397  1.019022
min   -1.328971 -1.336126 -1.128318 -1.585989
25%   -0.380623 -0.861657 -0.581481 -0.553453
50%   -0.084515  0.206974 -0.404901 -0.103511
75%    0.947407  1.372059 -0.209736  0.498618
max    1.466021  2.169890 -0.085670  1.343118

In [50]:
df.describe

<bound method DataFrame.describe of                    A         B         C         D
2013-01-01 -0.425488  2.169890 -0.168240  1.343118
2013-01-02  0.076999  0.773222 -0.475579  0.626561
2013-01-03 -0.246028 -0.359273 -0.616782  0.114790
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812
2013-01-05  1.466021  1.571671 -1.128318 -1.585989
2013-01-06 -1.328971 -1.336126 -0.085670 -0.630667>

In [51]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.425488    0.076999   -0.246028    1.237543    1.466021   -1.328971
B    2.169890    0.773222   -0.359273   -1.029119    1.571671   -1.336126
C   -0.168240   -0.475579   -0.616782   -0.334224   -1.128318   -0.085670
D    1.343118    0.626561    0.114790   -0.321812   -1.585989   -0.630667

In [52]:
df.sort

<bound method DataFrame.sort of                    A         B         C         D
2013-01-01 -0.425488  2.169890 -0.168240  1.343118
2013-01-02  0.076999  0.773222 -0.475579  0.626561
2013-01-03 -0.246028 -0.359273 -0.616782  0.114790
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812
2013-01-05  1.466021  1.571671 -1.128318 -1.585989
2013-01-06 -1.328971 -1.336126 -0.085670 -0.630667>

In [53]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.343118 -0.168240  2.169890 -0.425488
2013-01-02  0.626561 -0.475579  0.773222  0.076999
2013-01-03  0.114790 -0.616782 -0.359273 -0.246028
2013-01-04 -0.321812 -0.334224 -1.029119  1.237543
2013-01-05 -1.585989 -1.128318  1.571671  1.466021
2013-01-06 -0.630667 -0.085670 -1.336126 -1.328971

In [54]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.343118 -0.168240  2.169890 -0.425488
2013-01-02  0.626561 -0.475579  0.773222  0.076999
2013-01-03  0.114790 -0.616782 -0.359273 -0.246028
2013-01-04 -0.321812 -0.334224 -1.029119  1.237543
2013-01-05 -1.585989 -1.128318  1.571671  1.466021
2013-01-06 -0.630667 -0.085670 -1.336126 -1.328971

In [55]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -1.328971 -1.336126 -0.085670 -0.630667
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812
2013-01-03 -0.246028 -0.359273 -0.616782  0.114790
2013-01-02  0.076999  0.773222 -0.475579  0.626561
2013-01-05  1.466021  1.571671 -1.128318 -1.585989
2013-01-01 -0.425488  2.169890 -0.168240  1.343118

In [56]:
df['A']

2013-01-01   -0.425488
2013-01-02    0.076999
2013-01-03   -0.246028
2013-01-04    1.237543
2013-01-05    1.466021
2013-01-06   -1.328971
Freq: D, Name: A, dtype: float64

In [57]:
df[2:4]

                   A         B         C         D
2013-01-03 -0.246028 -0.359273 -0.616782  0.114790
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812

In [58]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.076999  0.773222 -0.475579  0.626561
2013-01-03 -0.246028 -0.359273 -0.616782  0.114790
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812

In [59]:
df.loc[dates[0]]

A   -0.425488
B    2.169890
C   -0.168240
D    1.343118
Name: 2013-01-01 00:00:00, dtype: float64

In [60]:
df.loc[dates[0]]

A   -0.425488
B    2.169890
C   -0.168240
D    1.343118
Name: 2013-01-01 00:00:00, dtype: float64

In [61]:
df.loc[:,['A','C']]

                   A         C
2013-01-01 -0.425488 -0.168240
2013-01-02  0.076999 -0.475579
2013-01-03 -0.246028 -0.616782
2013-01-04  1.237543 -0.334224
2013-01-05  1.466021 -1.128318
2013-01-06 -1.328971 -0.085670

In [62]:
df.loc[:,['A','C']]

                   A         C
2013-01-01 -0.425488 -0.168240
2013-01-02  0.076999 -0.475579
2013-01-03 -0.246028 -0.616782
2013-01-04  1.237543 -0.334224
2013-01-05  1.466021 -1.128318
2013-01-06 -1.328971 -0.085670

In [63]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.076999  0.773222
2013-01-03 -0.246028 -0.359273
2013-01-04  1.237543 -1.029119

In [64]:
df.loc[[1:2],['A','B']]

SyntaxError: invalid syntax (<ipython-input-64-240566fbdf6e>, line 1)

In [65]:
df

                   A         B         C         D
2013-01-01 -0.425488  2.169890 -0.168240  1.343118
2013-01-02  0.076999  0.773222 -0.475579  0.626561
2013-01-03 -0.246028 -0.359273 -0.616782  0.114790
2013-01-04  1.237543 -1.029119 -0.334224 -0.321812
2013-01-05  1.466021  1.571671 -1.128318 -1.585989
2013-01-06 -1.328971 -1.336126 -0.085670 -0.630667

In [80]:
df.loc[:,'E'] = np.array([3] * len(df))

In [77]:
df

                            A         B         C    D  E
2013-01-01 00:00:00 -0.425488  2.169890 -0.168240  5.0  3
2013-01-02 00:00:00  0.076999  0.773222 -0.475579  5.0  3
2013-01-03 00:00:00 -0.246028 -0.359273 -0.616782  5.0  3
2013-01-04 00:00:00  1.237543 -1.029119 -0.334224  5.0  3
2013-01-05 00:00:00  1.466021  1.571671 -1.128318  5.0  3
2013-01-06 00:00:00 -1.328971 -1.336126 -0.085670  5.0  3
2                         NaN       NaN       NaN  NaN  3

In [75]:
len(df)

7

In [81]:
df2 = df.copy()

df2

In [82]:
df2

                            A         B         C    D  E
2013-01-01 00:00:00 -0.425488  2.169890 -0.168240  5.0  3
2013-01-02 00:00:00  0.076999  0.773222 -0.475579  5.0  3
2013-01-03 00:00:00 -0.246028 -0.359273 -0.616782  5.0  3
2013-01-04 00:00:00  1.237543 -1.029119 -0.334224  5.0  3
2013-01-05 00:00:00  1.466021  1.571671 -1.128318  5.0  3
2013-01-06 00:00:00 -1.328971 -1.336126 -0.085670  5.0  3
2                         NaN       NaN       NaN  NaN  3
20130103                  NaN       NaN       NaN  NaN  3
20130103                  NaN       NaN       NaN  NaN  3

In [83]:
df2[df2 > 0] = -df2

In [84]:
df2

                            A         B         C    D  E
2013-01-01 00:00:00 -0.425488 -2.169890 -0.168240 -5.0 -3
2013-01-02 00:00:00 -0.076999 -0.773222 -0.475579 -5.0 -3
2013-01-03 00:00:00 -0.246028 -0.359273 -0.616782 -5.0 -3
2013-01-04 00:00:00 -1.237543 -1.029119 -0.334224 -5.0 -3
2013-01-05 00:00:00 -1.466021 -1.571671 -1.128318 -5.0 -3
2013-01-06 00:00:00 -1.328971 -1.336126 -0.085670 -5.0 -3
2                         NaN       NaN       NaN  NaN -3
20130103                  NaN       NaN       NaN  NaN -3
20130103                  NaN       NaN       NaN  NaN -3

In [86]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                            A         B         C    D  E
2013-01-01 00:00:00 -0.425488 -2.169890 -0.168240 -5.0 -3
2013-01-02 00:00:00 -0.076999 -0.773222 -0.475579 -5.0 -3
2013-01-03 00:00:00 -0.246028 -0.359273 -0.616782 -5.0 -3
2013-01-04 00:00:00 -1.237543 -1.029119 -0.334224 -5.0 -3
2013-01-05 00:00:00 -1.466021 -1.571671 -1.128318 -5.0 -3
2013-01-06 00:00:00 -1.328971 -1.336126 -0.085670 -5.0 -3
2                         NaN       NaN       NaN  NaN -3
20130103                  NaN       NaN       NaN  NaN -3
20130103                  NaN       NaN       NaN  NaN -3

In [ ]:
Out[54]: 
                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.509059 -5  NaN
2013-01-02 -1.212112 -0.173215 -0.119209 -5 -1.0
2013-01-03 -0.861849 -2.104569 -0.494929 -5 -2.0
2013-01-04 -0.721555 -0.706771 -1.039575 -5 -3.0
2013-01-05 -0.424972 -0.567020 -0.276232 -5 -4.0
2013-01-06 -0.673690 -0.113648 -1.478427 -5 -5.0

Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [89]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1],'E'] = 1

df1

                   A         B         C    D  E  E
2013-01-01 -0.425488  2.169890 -0.168240  5.0  1  1
2013-01-02  0.076999  0.773222 -0.475579  5.0  1  1
2013-01-03 -0.246028 -0.359273 -0.616782  5.0  3  3
2013-01-04  1.237543 -1.029119 -0.334224  5.0  3  3

In [ ]:
Out[57]: 
                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.509059  5  NaN  1.0
2013-01-02  1.212112 -0.173215  0.119209  5  1.0  1.0
2013-01-03 -0.861849 -2.104569 -0.494929  5  2.0  NaN
2013-01-04  0.721555 -0.706771 -1.039575  5  3.0  NaN

In [92]:


df1.dropna(how='any')

                   A         B         C    D  E  E
2013-01-01 -0.425488  2.169890 -0.168240  5.0  1  1
2013-01-02  0.076999  0.773222 -0.475579  5.0  1  1
2013-01-03 -0.246028 -0.359273 -0.616782  5.0  3  3
2013-01-04  1.237543 -1.029119 -0.334224  5.0  3  3

In [ ]:
Out[58]: 
                   A         B         C  D    F    E
2013-01-02  1.212112 -0.173215  0.119209  5  1.0  1.0

Filling missing data

In [93]:
In [59]: df1.fillna(value=5)

                   A         B         C    D  E  E
2013-01-01 -0.425488  2.169890 -0.168240  5.0  1  1
2013-01-02  0.076999  0.773222 -0.475579  5.0  1  1
2013-01-03 -0.246028 -0.359273 -0.616782  5.0  3  3
2013-01-04  1.237543 -1.029119 -0.334224  5.0  3  3

In [ ]:
Out[59]: 
                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.509059  5  5.0  1.0
2013-01-02  1.212112 -0.173215  0.119209  5  1.0  1.0
2013-01-03 -0.861849 -2.104569 -0.494929  5  2.0  5.0
2013-01-04  0.721555 -0.706771 -1.039575  5  3.0  5.0

To get the boolean mask where values are nan

In [94]:
In [60]: pd.isnull(df1)

                A      B      C      D      E      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False

In [ ]:
Out[60]: 
                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

Operations

See the Basic section on Binary Ops
Stats

Operations in general exclude missing data.

Performing a descriptive statistic

In [95]:
In [61]: df.mean()

A    0.130013
B    0.298378
C   -0.468136
D    5.000000
E    3.000000
dtype: float64

In [ ]:
Out[61]: 
A   -0.004474
B   -0.383981
C   -0.687758
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis

In [96]:
In [62]: df.mean(1)

2013-01-01 00:00:00    1.915232
2013-01-02 00:00:00    1.674928
2013-01-03 00:00:00    1.355583
2013-01-04 00:00:00    1.574840
2013-01-05 00:00:00    1.981875
2013-01-06 00:00:00    1.049847
2                      3.000000
20130103               3.000000
20130103               3.000000
dtype: float64

In [ ]:
Out[62]: 
2013-01-01    0.872735
2013-01-02    1.431621
2013-01-03    0.707731
2013-01-04    1.395042
2013-01-05    1.883656
2013-01-06    1.592306
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [100]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [102]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [ ]:
Out[64]: 
2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [104]:
df.sub(s, axis='index')

                            A         B         C    D    E
2013-01-01 00:00:00       NaN       NaN       NaN  NaN  NaN
2013-01-02 00:00:00       NaN       NaN       NaN  NaN  NaN
2013-01-03 00:00:00 -1.246028 -1.359273 -1.616782  4.0  2.0
2013-01-04 00:00:00 -1.762457 -4.029119 -3.334224  2.0  0.0
2013-01-05 00:00:00 -3.533979 -3.428329 -6.128318  0.0 -2.0
2013-01-06 00:00:00       NaN       NaN       NaN  NaN  NaN
2                         NaN       NaN       NaN  NaN  NaN
20130103                  NaN       NaN       NaN  NaN  NaN
20130103                  NaN       NaN       NaN  NaN  NaN

In [ ]:
Out[65]: 
                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.861849 -3.104569 -1.494929  4.0  1.0
2013-01-04 -2.278445 -3.706771 -4.039575  2.0  0.0
2013-01-05 -5.424972 -4.432980 -4.723768  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

Apply

Applying functions to the data

In [105]:
In [66]: df.apply(np.cumsum)

                            A         B         C     D   E
2013-01-01 00:00:00 -0.425488  2.169890 -0.168240   5.0   3
2013-01-02 00:00:00 -0.348489  2.943112 -0.643819  10.0   6
2013-01-03 00:00:00 -0.594517  2.583839 -1.260601  15.0   9
2013-01-04 00:00:00  0.643026  1.554720 -1.594825  20.0  12
2013-01-05 00:00:00  2.109047  3.126391 -2.723143  25.0  15
2013-01-06 00:00:00  0.780076  1.790265 -2.808814  30.0  18
2                         NaN       NaN       NaN   NaN  21
20130103                  NaN       NaN       NaN   NaN  24
20130103                  NaN       NaN       NaN   NaN  27

In [ ]:
Out[66]: 
                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.509059   5   NaN
2013-01-02  1.212112 -0.173215 -1.389850  10   1.0
2013-01-03  0.350263 -2.277784 -1.884779  15   3.0
2013-01-04  1.071818 -2.984555 -2.924354  20   6.0
2013-01-05  0.646846 -2.417535 -2.648122  25  10.0
2013-01-06 -0.026844 -2.303886 -4.126549  30  15.0

In [113]:
df.apply(lambda x: x.max() - x.min())

A    2.794991
B    3.506016
C    1.042648
D    0.000000
E    0.000000
dtype: float64

In [ ]:
Out[67]: 
A    2.073961
B    2.671590
C    1.785291
D    0.000000
F    4.000000
dtype: float64

Histogramming

See more at Histogramming and Discretization

In [108]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [114]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [ ]:
Out[69]: 
0    4
1    2
2    1
3    2
4    6
5    4
6    4
7    6
8    4
9    4
dtype: int64

In [112]:
s.value_counts()

cat     1
dog     1
CABA    1
Aaba    1
Baca    1
B       1
C       1
A       1
dtype: int64

In [ ]:
Out[70]: 
4    5
6    2
2    2
1    1
dtype: int64

String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses regular expressions by default (and in some cases always uses them). See more at Vectorized String Methods.

In [111]:
In [71]: s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [72]: s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [ ]:
Out[72]: 
0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

Merge
Concat

pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the Merging section

Concatenating pandas objects together with concat():

In [115]:
df = pd.DataFrame(np.random.randn(10, 4))

df

          0         1         2         3
0 -0.045244 -1.511655 -1.062714 -0.530642
1  0.566059  0.227612 -0.024157  0.040285
2  0.723703 -0.202817  0.348209  0.280956
3  1.201232 -1.926028 -0.542206 -0.066167
4 -1.439756  0.713830 -1.245956 -0.833545
5 -0.386367  0.337631 -1.283798 -1.555733
6 -0.682894  0.368542 -0.037436  0.066510
7  0.297244  0.886345  0.754010 -0.733967
8  0.878763 -0.134038 -0.261233  0.857163
9 -0.488844  0.142423  0.265343  0.779658

In [ ]:
Out[74]: 
          0         1         2         3
0 -0.548702  1.467327 -1.015962 -0.483075
1  1.637550 -1.217659 -0.291519 -1.745505
2 -0.263952  0.991460 -0.919069  0.266046
3 -0.709661  1.669052  1.037882 -1.705775
4 -0.919854 -0.042379  1.247642 -0.009920
5  0.290213  0.495767  0.362949  1.548106
6 -1.131345 -0.089329  0.337863 -0.945867
7 -0.932132  1.956030  0.017587 -0.016692
8 -0.575247  0.254161 -1.143704  0.215897
9  1.193555 -0.077118 -0.408530 -0.862495

# break it into pieces

In [119]:
pieces = [df[:3], df[3:7], df[7:]]

pd.concat(pieces)

          0         1         2         3
0 -0.045244 -1.511655 -1.062714 -0.530642
1  0.566059  0.227612 -0.024157  0.040285
2  0.723703 -0.202817  0.348209  0.280956
3  1.201232 -1.926028 -0.542206 -0.066167
4 -1.439756  0.713830 -1.245956 -0.833545
5 -0.386367  0.337631 -1.283798 -1.555733
6 -0.682894  0.368542 -0.037436  0.066510
7  0.297244  0.886345  0.754010 -0.733967
8  0.878763 -0.134038 -0.261233  0.857163
9 -0.488844  0.142423  0.265343  0.779658

In [ ]:
Out[76]: 
          0         1         2         3
0 -0.548702  1.467327 -1.015962 -0.483075
1  1.637550 -1.217659 -0.291519 -1.745505
2 -0.263952  0.991460 -0.919069  0.266046
3 -0.709661  1.669052  1.037882 -1.705775
4 -0.919854 -0.042379  1.247642 -0.009920
5  0.290213  0.495767  0.362949  1.548106
6 -1.131345 -0.089329  0.337863 -0.945867
7 -0.932132  1.956030  0.017587 -0.016692
8 -0.575247  0.254161 -1.143704  0.215897
9  1.193555 -0.077118 -0.408530 -0.862495

Join

SQL style merges. See the Database style joining

In [120]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

left

   key  lval
0  foo     1
1  foo     2

In [ ]:
Out[79]: 
   key  lval
0  foo     1
1  foo     2

In [121]:
In [80]: right

   key  rval
0  foo     4
1  foo     5

In [ ]:
Out[80]:

In [ ]:
   key  rval
0  foo     4
1  foo     5

In [122]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [ ]:
Out[81]: 
   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Another example that can be given is:

In [123]:
In [82]: left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [83]: right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [84]: left

   key  lval
0  foo     1
1  bar     2

In [ ]:
Out[84]: 
   key  lval
0  foo     1
1  bar     2

In [124]:
In [85]: right

   key  rval
0  foo     4
1  bar     5

In [ ]:
Out[85]: 
   key  rval
0  foo     4
1  bar     5

In [126]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [ ]:
Out[86]: 
   key  lval  rval
0  foo     1     4
1  bar     2     5

Append

Append rows to a dataframe. See the Appending

In [127]:
In [87]: df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [88]: df

          A         B         C         D
0 -0.024223 -0.727384  1.583486  0.652493
1 -0.495198 -1.373317 -0.523049 -0.072871
2 -0.912925 -1.005306 -0.337479  1.024438
3 -0.279148 -0.571067  1.407659  0.701530
4  0.108695  0.733644 -1.751836  0.699627
5  1.056007 -1.005064  0.132867  0.651148
6  0.881802  0.840909 -1.558312 -1.144794
7 -2.351330 -0.772603 -0.540371  0.103299

In [ ]:
Out[88]: 
          A         B         C         D
0  1.346061  1.511763  1.627081 -0.990582
1 -0.441652  1.211526  0.268520  0.024580
2 -1.577585  0.396823 -0.105381 -0.532532
3  1.453749  1.208843 -0.080952 -0.264610
4 -0.727965 -0.589346  0.339969 -0.693205
5 -0.339355  0.593616  0.884345  1.591431
6  0.141809  0.220390  0.435589  0.192451
7 -0.096701  0.803351  1.715071 -0.708758

In [128]:
s = df.iloc 
[3]

df.append(s, ignore_index=True)

          A         B         C         D
0 -0.024223 -0.727384  1.583486  0.652493
1 -0.495198 -1.373317 -0.523049 -0.072871
2 -0.912925 -1.005306 -0.337479  1.024438
3 -0.279148 -0.571067  1.407659  0.701530
4  0.108695  0.733644 -1.751836  0.699627
5  1.056007 -1.005064  0.132867  0.651148
6  0.881802  0.840909 -1.558312 -1.144794
7 -2.351330 -0.772603 -0.540371  0.103299
8 -0.279148 -0.571067  1.407659  0.701530

In [ ]:
Out[90]: 
          A         B         C         D
0  1.346061  1.511763  1.627081 -0.990582
1 -0.441652  1.211526  0.268520  0.024580
2 -1.577585  0.396823 -0.105381 -0.532532
3  1.453749  1.208843 -0.080952 -0.264610
4 -0.727965 -0.589346  0.339969 -0.693205
5 -0.339355  0.593616  0.884345  1.591431
6  0.141809  0.220390  0.435589  0.192451
7 -0.096701  0.803351  1.715071 -0.708758
8  1.453749  1.208843 -0.080952 -0.264610

Grouping

By group by we are referring to a process involving one or more of the following steps

        Splitting the data into groups based on some criteria
        Applying a function to each group independently
        Combining the results into a data structure

See the Grouping section

In [131]:
In [91]: df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
   ....: 

In [92]: df

     A      B         C         D
0  foo    one -1.381999 -0.235246
1  bar    one -0.242522  0.462553
2  foo    two -0.278431 -0.616551
3  bar  three  1.029757  0.696647
4  foo    two  0.000265 -0.753761
5  bar    two -0.253559  0.244192
6  foo    one -0.251860 -2.632585
7  foo  three  1.723936 -0.973642

In [ ]:
Out[92]: 
     A      B         C         D
0  foo    one -1.202872 -0.055224
1  bar    one -1.814470  2.395985
2  foo    two  1.018601  1.552825
3  bar  three -0.595447  0.166599
4  foo    two  1.395433  0.047609
5  bar    two -0.392670 -0.136473
6  foo    one  0.007207 -0.561757
7  foo  three  1.928123 -1.623033

Grouping and then applying a function sum to the resulting groups.

In [132]:
In [93]: df.groupby('A').sum()

            C         D
A
bar  0.533676  1.403393
foo -0.188090 -5.211786

In [ ]:
Out[93]: 
            C        D
A                     
bar -2.802588  2.42611
foo  3.146492 -0.63958

Grouping by multiple columns forms a hierarchical index, which we then apply the function.

In [133]:
In [94]: df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.242522  0.462553
    three  1.029757  0.696647
    two   -0.253559  0.244192
foo one   -1.633860 -2.867831
    three  1.723936 -0.973642
    two   -0.278166 -1.370312

In [ ]:
Out[94]: 
                  C         D
A   B                        
bar one   -1.814470  2.395985
    three -0.595447  0.166599
    two   -0.392670 -0.136473
foo one   -1.195665 -0.616981
    three  1.928123 -1.623033
    two    2.414034  1.600434

Reshaping

See the sections on Hierarchical Indexing and Reshaping.
Stack

In [134]:
In [95]: tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
   ....: 

In [96]: index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [97]: df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [98]: df2 = df[:4]

In [99]: df2

                     A         B
first second
bar   one     0.035073 -0.617343
      two    -1.352203 -1.179640
baz   one    -0.715956  0.303899
      two     1.352720 -0.257552

In [ ]:
Out[99]: 
                     A         B
first second                    
bar   one     0.029399 -0.542108
      two     0.282696 -0.087302
baz   one    -1.575170  1.771208
      two     0.816482  1.100230

The stack() method compresses a level in the DataFrames columns.

In [135]:
In [100]: stacked = df2.stack()

In [101]: stacked

first  second
bar    one     A    0.035073
               B   -0.617343
       two     A   -1.352203
               B   -1.179640
baz    one     A   -0.715956
               B    0.303899
       two     A    1.352720
               B   -0.257552
dtype: float64

In [ ]:
Out[101]: 
first  second   
bar    one     A    0.029399
               B   -0.542108
       two     A    0.282696
               B   -0.087302
baz    one     A   -1.575170
               B    1.771208
       two     A    0.816482
               B    1.100230
dtype: float64

With a stacked DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the last level:

In [136]:
In [102]: stacked.unstack()

                     A         B
first second
bar   one     0.035073 -0.617343
      two    -1.352203 -1.179640
baz   one    -0.715956  0.303899
      two     1.352720 -0.257552

In [ ]:
Out[102]: 
                     A         B
first second                    
bar   one     0.029399 -0.542108
      two     0.282696 -0.087302
baz   one    -1.575170  1.771208
      two     0.816482  1.100230

In [137]:
In [103]: stacked.unstack(1)

second        one       two
first
bar   A  0.035073 -1.352203
      B -0.617343 -1.179640
baz   A -0.715956  1.352720
      B  0.303899 -0.257552

In [ ]:
Out[103]: 
second        one       two
first                      
bar   A  0.029399  0.282696
      B -0.542108 -0.087302
baz   A -1.575170  0.816482
      B  1.771208  1.100230

In [138]:
In [104]: stacked.unstack(0)

first          bar       baz
second
one    A  0.035073 -0.715956
       B -0.617343  0.303899
two    A -1.352203  1.352720
       B -1.179640 -0.257552

In [ ]:
Out[104]: 
first          bar       baz
second                      
one    A  0.029399 -1.575170
       B -0.542108  1.771208
two    A  0.282696  0.816482
       B -0.087302  1.100230

Pivot Tables

See the section on Pivot Tables.

In [139]:
In [105]: df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})
   .....: 

In [106]: df

        A  B    C         D         E
0     one  A  foo  0.809671  0.197734
1     one  B  foo -0.164873  1.690280
2     two  C  foo -0.483617 -0.000275
3   three  A  bar -0.370082 -0.944499
4     one  B  bar -0.398312  1.618814
5     one  C  bar  0.774851  0.466057
6     two  A  foo  1.282699  1.008003
7   three  B  foo -1.119050  0.586597
8     one  C  foo -0.718835  0.987221
9     one  A  bar -2.271714 -1.049519
10    two  B  bar -0.294070  0.537048
11  three  C  bar  0.329921 -1.277488

In [ ]:
Out[106]: 
        A  B    C         D         E
0     one  A  foo  1.418757 -0.179666
1     one  B  foo -1.879024  1.291836
2     two  C  foo  0.536826 -0.009614
3   three  A  bar  1.006160  0.392149
4     one  B  bar -0.029716  0.264599
5     one  C  bar -1.146178 -0.057409
6     two  A  foo  0.100900 -1.425638
7   three  B  foo -1.035018  1.024098
8     one  C  foo  0.314665 -0.106062
9     one  A  bar -0.773723  1.824375
10    two  B  bar -1.170653  0.595974
11  three  C  bar  0.648740  1.167115

We can produce pivot tables from this data very easily:

In [140]:
In [107]: pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -2.271714  0.809671
      B -0.398312 -0.164873
      C  0.774851 -0.718835
three A -0.370082       NaN
      B       NaN -1.119050
      C  0.329921       NaN
two   A       NaN  1.282699
      B -0.294070       NaN
      C       NaN -0.483617

In [ ]:
Out[107]: 
C             bar       foo
A     B                    
one   A -0.773723  1.418757
      B -0.029716 -1.879024
      C -1.146178  0.314665
three A  1.006160       NaN
      B       NaN -1.035018
      C  0.648740       NaN
two   A       NaN  0.100900
      B -1.170653       NaN
      C       NaN  0.536826

Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the Time Series section

In [141]:
In [108]: rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [109]: ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [110]: ts.resample('5Min').sum()

2012-01-01    25929
Freq: 5T, dtype: int32

In [ ]:
Out[110]: 
2012-01-01    25083
Freq: 5T, dtype: int64

Time zone representation

In [142]:
In [111]: rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [112]: ts = pd.Series(np.random.randn(len(rng)), rng)

In [113]: ts

2012-03-06    0.398244
2012-03-07    0.957572
2012-03-08   -2.362878
2012-03-09    0.458460
2012-03-10   -1.632203
Freq: D, dtype: float64

In [143]:
Out[113]: 
2012-03-06    0.464000
2012-03-07    0.227371
2012-03-08   -0.496922
2012-03-09    0.306389
2012-03-10   -2.290613
Freq: D, dtype: float64

SyntaxError: invalid syntax (<ipython-input-143-ced921571034>, line 1)

In [144]:
In [114]: ts_utc = ts.tz_localize('UTC')

In [115]: ts_utc

2012-03-06 00:00:00+00:00    0.398244
2012-03-07 00:00:00+00:00    0.957572
2012-03-08 00:00:00+00:00   -2.362878
2012-03-09 00:00:00+00:00    0.458460
2012-03-10 00:00:00+00:00   -1.632203
Freq: D, dtype: float64

In [145]:
Out[115]: 
2012-03-06 00:00:00+00:00    0.464000
2012-03-07 00:00:00+00:00    0.227371
2012-03-08 00:00:00+00:00   -0.496922
2012-03-09 00:00:00+00:00    0.306389
2012-03-10 00:00:00+00:00   -2.290613
Freq: D, dtype: float64

Convert to another time zone

SyntaxError: invalid syntax (<ipython-input-145-72a87f1bc029>, line 1)

In [147]:
In [116]: ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.398244
2012-03-06 19:00:00-05:00    0.957572
2012-03-07 19:00:00-05:00   -2.362878
2012-03-08 19:00:00-05:00    0.458460
2012-03-09 19:00:00-05:00   -1.632203
Freq: D, dtype: float64

In [ ]:
Out[116]: 
2012-03-05 19:00:00-05:00    0.464000
2012-03-06 19:00:00-05:00    0.227371
2012-03-07 19:00:00-05:00   -0.496922
2012-03-08 19:00:00-05:00    0.306389
2012-03-09 19:00:00-05:00   -2.290613
Freq: D, dtype: float64

Converting between time span representations

In [148]:
In [117]: rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [118]: ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [119]: ts

2012-01-31    0.056339
2012-02-29    0.128705
2012-03-31    1.062268
2012-04-30    1.179919
2012-05-31    1.586088
Freq: M, dtype: float64

In [ ]:
Out[119]: 
2012-01-31   -1.134623
2012-02-29   -1.561819
2012-03-31   -0.260838
2012-04-30    0.281957
2012-05-31    1.523962
Freq: M, dtype: float64

In [ ]:
In [120]: ps = ts.to_period()

In [121]: ps

In [ ]:
Out[121]: 
2012-01   -1.134623
2012-02   -1.561819
2012-03   -0.260838
2012-04    0.281957
2012-05    1.523962
Freq: M, dtype: float64

In [ ]:
In [122]: ps.to_timestamp()

In [ ]:
Out[122]: 
2012-01-01   -1.134623
2012-02-01   -1.561819
2012-03-01   -0.260838
2012-04-01    0.281957
2012-05-01    1.523962
Freq: MS, dtype: float64

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [ ]:
In [123]: prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [124]: ts = pd.Series(np.random.randn(len(prng)), prng)

In [125]: ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [126]: ts.head()

In [ ]:
Out[126]: 
1990-03-01 09:00   -0.902937
1990-06-01 09:00    0.068159
1990-09-01 09:00   -0.057873
1990-12-01 09:00   -0.368204
1991-03-01 09:00   -1.144073
Freq: H, dtype: float64

Categoricals

Since version 0.15, pandas can include categorical data in a DataFrame. For full docs, see the categorical introduction and the API documentation.

In [ ]:
In [127]: df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [ ]:
Convert the raw grades to a categorical data type.

In [ ]:
In [128]: df["grade"] = df["raw_grade"].astype("category")

In [129]: df["grade"]

In [ ]:
Out[129]: 
0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

Rename the categories to more meaningful names (assigning to Series.cat.categories is inplace!)

In [ ]:
In [130]: df["grade"].cat.categories = ["very good", "good", "very bad"]

Reorder the categories and simultaneously add the missing categories (methods under Series .cat return a new Series per default).

In [131]: df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [132]: df["grade"]

In [ ]:
Out[132]: 
0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

Sorting is per order in the categories, not lexical order.

In [ ]:
In [133]: df.sort_values(by="grade")

In [ ]:
Out[133]: 
   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

Grouping by a categorical column shows also empty categories.

In [ ]:
In [134]: df.groupby("grade").size()

In [ ]:
Out[134]: 
grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

Plotting

Plotting docs.

In [ ]:
In [135]: ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [136]: ts = ts.cumsum()

In [137]: ts.plot()

In [ ]:
Out[137]: <matplotlib.axes._subplots.AxesSubplot at 0x7ff2ab2af550>

_images/series_plot_basic.png

On DataFrame, plot() is a convenience to plot all of the columns with labels:

In [ ]:
In [138]: df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
   .....:                   columns=['A', 'B', 'C', 'D'])
   .....: 

In [139]: df = df.cumsum()

In [140]: plt.figure(); df.plot(); plt.legend(loc='best')

In [ ]:
Out[140]: <matplotlib.legend.Legend at 0x7ff29c8163d0>

_images/frame_plot_basic.png
Getting Data In/Out
CSV

Writing to a csv file

In [ ]:
In [141]: df.to_csv('foo.csv')

In [ ]:
Reading from a csv file

In [ ]:
In [142]: pd.read_csv('foo.csv')

In [ ]:
Out[142]: 
     Unnamed: 0          A          B         C          D
0    2000-01-01   0.266457  -0.399641 -0.219582   1.186860
1    2000-01-02  -1.170732  -0.345873  1.653061  -0.282953
2    2000-01-03  -1.734933   0.530468  2.060811  -0.515536
3    2000-01-04  -1.555121   1.452620  0.239859  -1.156896
4    2000-01-05   0.578117   0.511371  0.103552  -2.428202
5    2000-01-06   0.478344   0.449933 -0.741620  -1.962409
6    2000-01-07   1.235339  -0.091757 -1.543861  -1.084753
..          ...        ...        ...       ...        ...
993  2002-09-20 -10.628548  -9.153563 -7.883146  28.313940
994  2002-09-21 -10.390377  -8.727491 -6.399645  30.914107
995  2002-09-22  -8.985362  -8.485624 -4.669462  31.367740
996  2002-09-23  -9.558560  -8.781216 -4.499815  30.518439
997  2002-09-24  -9.902058  -9.340490 -4.386639  30.105593
998  2002-09-25 -10.216020  -9.480682 -3.933802  29.758560
999  2002-09-26 -11.856774 -10.671012 -3.216025  29.369368

[1000 rows x 5 columns]

HDF5

Reading and writing to HDFStores

Writing to a HDF5 Store

In [ ]:
In [143]: df.to_hdf('foo.h5','df')

In [ ]:
Reading from a HDF5 Store

In [ ]:
In [144]: pd.read_hdf('foo.h5','df')

In [ ]:
Out[144]: 
                    A          B         C          D
2000-01-01   0.266457  -0.399641 -0.219582   1.186860
2000-01-02  -1.170732  -0.345873  1.653061  -0.282953
2000-01-03  -1.734933   0.530468  2.060811  -0.515536
2000-01-04  -1.555121   1.452620  0.239859  -1.156896
2000-01-05   0.578117   0.511371  0.103552  -2.428202
2000-01-06   0.478344   0.449933 -0.741620  -1.962409
2000-01-07   1.235339  -0.091757 -1.543861  -1.084753
...               ...        ...       ...        ...
2002-09-20 -10.628548  -9.153563 -7.883146  28.313940
2002-09-21 -10.390377  -8.727491 -6.399645  30.914107
2002-09-22  -8.985362  -8.485624 -4.669462  31.367740
2002-09-23  -9.558560  -8.781216 -4.499815  30.518439
2002-09-24  -9.902058  -9.340490 -4.386639  30.105593
2002-09-25 -10.216020  -9.480682 -3.933802  29.758560
2002-09-26 -11.856774 -10.671012 -3.216025  29.369368

[1000 rows x 4 columns]

Excel

Reading and writing to MS Excel

Writing to an excel file

In [ ]:
In [145]: df.to_excel('foo.xlsx', sheet_name='Sheet1')

In [ ]:
Reading from an excel file

In [ ]:
In [146]: pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

In [85]:
Out[146]: 
                    A          B         C          D
2000-01-01   0.266457  -0.399641 -0.219582   1.186860
2000-01-02  -1.170732  -0.345873  1.653061  -0.282953
2000-01-03  -1.734933   0.530468  2.060811  -0.515536
2000-01-04  -1.555121   1.452620  0.239859  -1.156896
2000-01-05   0.578117   0.511371  0.103552  -2.428202
2000-01-06   0.478344   0.449933 -0.741620  -1.962409
2000-01-07   1.235339  -0.091757 -1.543861  -1.084753
...               ...        ...       ...        ...
2002-09-20 -10.628548  -9.153563 -7.883146  28.313940
2002-09-21 -10.390377  -8.727491 -6.399645  30.914107
2002-09-22  -8.985362  -8.485624 -4.669462  31.367740
2002-09-23  -9.558560  -8.781216 -4.499815  30.518439
2002-09-24  -9.902058  -9.340490 -4.386639  30.105593
2002-09-25 -10.216020  -9.480682 -3.933802  29.758560
2002-09-26 -11.856774 -10.671012 -3.216025  29.369368

[1000 rows x 4 columns]

Gotchas

If you are trying an operation and you see an exception like:

>>> if pd.Series([False, True, False]):
    print("I was true")
Traceback
    ...
ValueError: The truth value of an array is ambiguous. Use a.empty, a.any() or a.all().

See Comparisons for an explanation and what to do.

See Gotchas as well.

SyntaxError: invalid syntax (<ipython-input-85-4e72c70f64a0>, line 6)